import React from 'react'
import style from './Info.module.scss'

const Info = () => {
  return (
    <div className={style.wrapper}>
      <h1 className={style.header}>Информация о приложении</h1>
      <p className={style.paragraph}>Добро пожаловать в приложение по учету характеристик организма.
        Приложение учитывает вес, проценты жировой и мышечной ткани, а также содержание воды в организме.
        Для мужчин доступна опция по учету пропорций тела, а именно объему основных его частей.</p>
      <p className={style.paragraph}> Чтобы использовать приложение, необходимо ввести все необходимые данные в
        предоставленные поля
        в верхней части экрана и подтвердить ввод данных. Для получения необходимых данных желательно иметь в
        распоряжении
        весы с опцией измерения мышечной, жировой и водной массы организма. Если таких весов нет, можно вводить лишь
        дату измерения и текущий вес, но приложение предупредит вас о неточности и не будет отображать не введенные
        параметры на графиках.</p>
      <p className={style.paragraph}>Данные приложения отображаются на соответствующих подписанных графиках в
        приложении. На графиках
        соответствующим датам подставлены соответствующие значения, при наведении на которые можно получить
        дополнительную информацию.</p>
      <p className={style.paragraph}>Если вы решите изменить данные за определенную дату, просто введите измененные
        значения в предоставленные поля вверху и подтвердите замену данных по соответствующей дате. Чтобы удалить
        данные за определенный период, щелкните по соответствующей точке на любом из графиков и подтвердите удаление
        данных за эту дату.</p>
      <p className={style.paragraph}>После полей ввода перед графиками предоставлена характеристика организма
        в соответствии с последними параметрами, введенными пользователем, и дополнительными параметрами
        - пола, роста и возраста. Вы можете ввести эти данные в соответствующем обрамленном окне в этой части
        приложения.
        Чтобы сменить пол, щелкните по кнопке М или Ж, остальные данные вводятся с клавиатуры.
        Данные обновляются автоматически по мере ввода пользователем и сохраняются в приложении.</p>
      <p className={style.paragraph}>Чтобы иметь возможность учитывать пропорции тела, в графе характеристик организма
        должен быть включен
        мужской пол. По составу данная секция похода на секцию с параметрами тела: необходимо ввести все данные и
        смотреть результат
        на соответствующих подписанных графиках. Удаление и изменение работает по такому же принципу.</p>
      <p className={style.paragraph}>В верхней части приложения находятся кнопки информации и персонального аккаунта
        (последняя пока находится в состоянии разработки и не функционирует на полную мощность). Нажав на кнопку
        {/* eslint-disable-next-line react/no-unescaped-entities */}
        "Информация",
        можно посмотреть различные таблицы, используемые для расчета в этом приложении, а также перейти на вкладку
        {/* eslint-disable-next-line react/no-unescaped-entities */}
        с информацией о приложении, нажав на кнопку в верхнем правом углу. Во вкладке "Аккаунт" можно скачать данные в
        текстовом формате,
        загрузить данные из текстового формата с компьютера, а также сбросить прогресс, удалив все данные
        приложения.</p>
      <p className={style.paragraph}>Не пытайтесь ломать приложение и делать какие-то странные вещи, мне было лень
        предусмотреть все исключительные ситуации :)</p>
    </div>
  )
}

export default Info
